# St7SetBeamSpringCoils

Sets the number of coils displayed for spring elements.

long St7SetBeamSpringCoils(long uID, long Coils)

Input Parameters

uID

Strand7 model file ID.

Beam Entity Display

Coils

The number of coils to display in the range kMinSpringCoils to kMaxSpringCoils.